Sohan-Chitluri/HyprAccel/mbd/editor/test/fixtures/codegen_baseline/cli_esp32.h
/*
 * hyp_board_config.h
 *
 * Generated by HyprAccel CORE-T3 codegen.
 * Target Board: ESP32 (WROOM-32)
 * Architecture: xtensa-lx6
 *
 * FW-P1..P6: Per-signal pin macros are emitted for every bus resource defined
 * in boards.yaml so that hyp_esp32_hw.cpp can initialise peripherals from this
 * generated configuration rather than hardcoded constants.
 */

#ifndef HYP_BOARD_CONFIG_H
#define HYP_BOARD_CONFIG_H

#define HYP_BOARD_NAME "ESP32 (WROOM-32)"
#define HYP_BOARD_ARCH_XTENSA_LX6 1
#define HYP_SYSCLK_MHZ 240

/* Transport Configuration */
#define HYP_FPGA_TRANSPORT_TYPE "SPI"
#define HYP_FPGA_TRANSPORT_SPI 1

/* Hardware Accelerators */
#define HYP_HAS_HW_CORDIC 1

/* SPI Bus Pin Definitions (FW-P3) */
#define HYP_RESOURCE_SPI_HSPI 1
#define HYP_RESOURCE_SPI_HSPI_SCK_PIN 14  /* GPIO14 */
#define HYP_RESOURCE_SPI_HSPI_MOSI_PIN 13  /* GPIO13 */
#define HYP_RESOURCE_SPI_HSPI_MISO_PIN 12  /* GPIO12 */
#define HYP_RESOURCE_SPI_HSPI_CS_PIN 15  /* GPIO15 */
#define HYP_RESOURCE_SPI_VSPI 1
#define HYP_RESOURCE_SPI_VSPI_SCK_PIN 18  /* GPIO18 */
#define HYP_RESOURCE_SPI_VSPI_MOSI_PIN 23  /* GPIO23 */
#define HYP_RESOURCE_SPI_VSPI_MISO_PIN 19  /* GPIO19 */
#define HYP_RESOURCE_SPI_VSPI_CS_PIN 5  /* GPIO5 */

/* I2C Bus Pin Definitions (FW-P4) */
#define HYP_RESOURCE_I2C_I2C0 1
#define HYP_RESOURCE_I2C_I2C0_SCL_PIN 22  /* GPIO22 */
#define HYP_RESOURCE_I2C_I2C0_SDA_PIN 21  /* GPIO21 */
#define HYP_RESOURCE_I2C_IMU 1
#define HYP_RESOURCE_I2C_IMU_ADDRESS 0x68  /* device "imu" on i2c0 */

/* I2C Device Address Table (SDK-T6): semantic device name -> 7-bit slave address.
 * Consumed by the runtime to build hyp_i2c_device_table[]. */
#define HYP_I2C_DEVICE_TABLE \
    { "imu", HYP_RESOURCE_I2C_IMU_ADDRESS }

/* UART Pin Definitions (FW-P2) */
#define HYP_RESOURCE_UART_UART0 1
#define HYP_RESOURCE_UART_UART0_TX_PIN 1  /* GPIO1 */
#define HYP_RESOURCE_UART_UART0_RX_PIN 3  /* GPIO3 */
#define HYP_RESOURCE_UART_UART1 1
#define HYP_RESOURCE_UART_UART1_TX_PIN 10  /* GPIO10 */
#define HYP_RESOURCE_UART_UART1_RX_PIN 9  /* GPIO9 */
#define HYP_RESOURCE_UART_UART2 1
#define HYP_RESOURCE_UART_UART2_TX_PIN 17  /* GPIO17 */
#define HYP_RESOURCE_UART_UART2_RX_PIN 16  /* GPIO16 */

/* PWM Pin Definitions (FW-P5) */
#define HYP_RESOURCE_PWM_GPIO25 1
#define HYP_RESOURCE_PWM_GPIO25_PIN 25  /* GPIO25 */
#define HYP_RESOURCE_PWM_GPIO26 1
#define HYP_RESOURCE_PWM_GPIO26_PIN 26  /* GPIO26 */
#define HYP_RESOURCE_PWM_GPIO27 1
#define HYP_RESOURCE_PWM_GPIO27_PIN 27  /* GPIO27 */
#define HYP_RESOURCE_PWM_GPIO32 1
#define HYP_RESOURCE_PWM_GPIO32_PIN 32  /* GPIO32 */
#define HYP_RESOURCE_PWM_GPIO33 1
#define HYP_RESOURCE_PWM_GPIO33_PIN 33  /* GPIO33 */

/* ADC Pin Definitions (FW-P6) */
#define HYP_RESOURCE_ADC_GPIO32 1
#define HYP_RESOURCE_ADC_GPIO32_PIN 32  /* GPIO32 */
#define HYP_RESOURCE_ADC_GPIO33 1
#define HYP_RESOURCE_ADC_GPIO33_PIN 33  /* GPIO33 */
#define HYP_RESOURCE_ADC_GPIO34 1
#define HYP_RESOURCE_ADC_GPIO34_PIN 34  /* GPIO34 */
#define HYP_RESOURCE_ADC_GPIO35 1
#define HYP_RESOURCE_ADC_GPIO35_PIN 35  /* GPIO35 */
#define HYP_RESOURCE_ADC_GPIO36 1
#define HYP_RESOURCE_ADC_GPIO36_PIN 36  /* GPIO36 */
#define HYP_RESOURCE_ADC_GPIO39 1
#define HYP_RESOURCE_ADC_GPIO39_PIN 39  /* GPIO39 */

/* GPIO Pin Definitions (FW-P1) */
#define HYP_RESOURCE_GPIO_GPIO0 1
#define HYP_RESOURCE_GPIO_GPIO0_PIN 0  /* GPIO0 */
#define HYP_RESOURCE_GPIO_GPIO1 1
#define HYP_RESOURCE_GPIO_GPIO1_PIN 1  /* GPIO1 */
#define HYP_RESOURCE_GPIO_GPIO2 1
#define HYP_RESOURCE_GPIO_GPIO2_PIN 2  /* GPIO2 */
#define HYP_RESOURCE_GPIO_GPIO3 1
#define HYP_RESOURCE_GPIO_GPIO3_PIN 3  /* GPIO3 */
#define HYP_RESOURCE_GPIO_GPIO4 1
#define HYP_RESOURCE_GPIO_GPIO4_PIN 4  /* GPIO4 */
#define HYP_RESOURCE_GPIO_GPIO5 1
#define HYP_RESOURCE_GPIO_GPIO5_PIN 5  /* GPIO5 */
#define HYP_RESOURCE_GPIO_GPIO12 1
#define HYP_RESOURCE_GPIO_GPIO12_PIN 12  /* GPIO12 */
#define HYP_RESOURCE_GPIO_GPIO13 1
#define HYP_RESOURCE_GPIO_GPIO13_PIN 13  /* GPIO13 */
#define HYP_RESOURCE_GPIO_GPIO14 1
#define HYP_RESOURCE_GPIO_GPIO14_PIN 14  /* GPIO14 */
#define HYP_RESOURCE_GPIO_GPIO15 1
#define HYP_RESOURCE_GPIO_GPIO15_PIN 15  /* GPIO15 */
#define HYP_RESOURCE_GPIO_GPIO16 1
#define HYP_RESOURCE_GPIO_GPIO16_PIN 16  /* GPIO16 */
#define HYP_RESOURCE_GPIO_GPIO17 1
#define HYP_RESOURCE_GPIO_GPIO17_PIN 17  /* GPIO17 */
#define HYP_RESOURCE_GPIO_GPIO18 1
#define HYP_RESOURCE_GPIO_GPIO18_PIN 18  /* GPIO18 */
#define HYP_RESOURCE_GPIO_GPIO19 1
#define HYP_RESOURCE_GPIO_GPIO19_PIN 19  /* GPIO19 */
#define HYP_RESOURCE_GPIO_GPIO21 1
#define HYP_RESOURCE_GPIO_GPIO21_PIN 21  /* GPIO21 */
#define HYP_RESOURCE_GPIO_GPIO22 1
#define HYP_RESOURCE_GPIO_GPIO22_PIN 22  /* GPIO22 */
#define HYP_RESOURCE_GPIO_GPIO23 1
#define HYP_RESOURCE_GPIO_GPIO23_PIN 23  /* GPIO23 */
#define HYP_RESOURCE_GPIO_GPIO25 1
#define HYP_RESOURCE_GPIO_GPIO25_PIN 25  /* GPIO25 */
#define HYP_RESOURCE_GPIO_GPIO26 1
#define HYP_RESOURCE_GPIO_GPIO26_PIN 26  /* GPIO26 */
#define HYP_RESOURCE_GPIO_GPIO27 1
#define HYP_RESOURCE_GPIO_GPIO27_PIN 27  /* GPIO27 */
#define HYP_RESOURCE_GPIO_GPIO32 1
#define HYP_RESOURCE_GPIO_GPIO32_PIN 32  /* GPIO32 */
#define HYP_RESOURCE_GPIO_GPIO33 1
#define HYP_RESOURCE_GPIO_GPIO33_PIN 33  /* GPIO33 */
#define HYP_RESOURCE_GPIO_GPIO34 1
#define HYP_RESOURCE_GPIO_GPIO34_PIN 34  /* GPIO34 */
#define HYP_RESOURCE_GPIO_GPIO35 1
#define HYP_RESOURCE_GPIO_GPIO35_PIN 35  /* GPIO35 */
#define HYP_RESOURCE_GPIO_GPIO36 1
#define HYP_RESOURCE_GPIO_GPIO36_PIN 36  /* GPIO36 */
#define HYP_RESOURCE_GPIO_GPIO39 1
#define HYP_RESOURCE_GPIO_GPIO39_PIN 39  /* GPIO39 */

/*
 * Project Pin Assignments
 * (Augmented by MBD-T1b during node graph synthesis with
 * HYP_PIN_* and HYP_PERIPH_* defines for configured hardware resources.)
 */

#endif /* HYP_BOARD_CONFIG_H */
